# RbsGbxmlOpeningType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsGbxmlOpeningType Property
ParameterTypeId Class See Also
---
"Opening Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsGbxmlOpeningType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsGbxmlOpeningType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsGbxmlOpeningType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace